Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
      + arn                       = "arn:aws:autoscaling:us-east-2:398963803929:autoScalingGroup:9e3b9681-ab44-4ae5-bb1c-4ea6d6327b68:autoScalingGroupName/atlantis_ecs"
      ~ availability_zones        = [
          + "us-east-2a",
          + "us-east-2b",
        ]
      + capacity_rebalance        = false
      + default_cooldown          = 300
      + enabled_metrics           = []
        id                        = "atlantis_ecs"
      + load_balancers            = []
      + max_instance_lifetime     = 0
        name                      = "atlantis_ecs"
      + service_linked_role_arn   = "arn:aws:iam::398963803929:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
      + suspended_processes       = []
      + target_group_arns         = []
      + termination_policies      = []
        # (13 unchanged attributes hidden)

      - tag {
          - key                 = "Env" -> null
          - propagate_at_launch = false -> null
          - value               = "teste" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.ubuntu_20_04 has changed
~ resource "aws_launch_configuration" "ubuntu_20_04" {
        id                               = "atlantis_ecs"
        name                             = "atlantis_ecs"
      + security_groups                  = []
      + vpc_classic_link_security_groups = []
        # (6 unchanged attributes hidden)
    }

  # aws_lb.lb_ecs has changed
~ resource "aws_lb" "lb_ecs" {
        id                         = "arn:aws:elasticloadbalancing:us-east-2:398963803929:loadbalancer/app/lb-ecs/1ba5a14d83255d1b"
        name                       = "lb-ecs"
        tags                       = {
            "Environment" = "teste"
        }
        # (17 unchanged attributes hidden)


      - subnet_mapping {
          - subnet_id = "subnet-01eb577852a061ca1" -> null
        }
        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_bar will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723"
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.atlantis_ecs is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "atlantis_ecs" {
      ~ arn                       = "arn:aws:autoscaling:us-east-2:398963803929:autoScalingGroup:9e3b9681-ab44-4ae5-bb1c-4ea6d6327b68:autoScalingGroupName/atlantis_ecs" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-2a",
          - "us-east-2b",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ id                        = "atlantis_ecs" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
        name                      = "atlantis_ecs"
      + name_prefix               = (known after apply)
      - placement_group           = "test" -> null
      ~ service_linked_role_arn   = "arn:aws:iam::398963803929:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
        # (12 unchanged attributes hidden)

      + tag {
          + key                 = "Env"
          + propagate_at_launch = false
          + value               = "teste"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_placement_group.atlantis_ecs will be destroyed
  # (because aws_placement_group.atlantis_ecs is not in configuration)
- resource "aws_placement_group" "atlantis_ecs" {
      - arn                = "arn:aws:ec2:us-east-2:398963803929:placement-group/test" -> null
      - id                 = "test" -> null
      - name               = "test" -> null
      - partition_count    = 0 -> null
      - placement_group_id = "pg-07aa29a5a29b00105" -> null
      - strategy           = "cluster" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
